Term4/metopt/lectures/1-2.tex
% Created 2021-02-27 Sat 17:18
% Intended LaTeX compiler: pdflatex
\documentclass[english]{article}
\usepackage[T1, T2A]{fontenc}
\usepackage[lutf8]{luainputenc}
\usepackage[english, russian]{babel}
\usepackage{minted}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{hyperref}
\usepackage{xcolor}
\usepackage{natbib}
\usepackage{amssymb}
\usepackage{amsmath}
\usepackage{caption}
\usepackage{mathtools}
\usepackage{amsthm}
\usepackage{tikz}
\usepackage{grffile}
\usepackage{extarrows}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage{placeins}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{capt-of}

\usepackage{geometry}
\geometry{a4paper,left=2.5cm,top=2cm,right=2.5cm,bottom=2cm,marginparsep=7pt, marginparwidth=.6in}

 \usepackage{hyperref}
 \hypersetup{
     colorlinks=true,
     linkcolor=blue,
     filecolor=orange,
     citecolor=black,      
     urlcolor=cyan,
     }

\usetikzlibrary{decorations.markings}
\usetikzlibrary{cd}
\usetikzlibrary{patterns}

\newcommand\addtag{\refstepcounter{equation}\tag{\theequation}}
\newcommand{\eqrefoffset}[1]{\addtocounter{equation}{-#1}(\arabic{equation}\addtocounter{equation}{#1})}


\newcommand{\R}{\mathbb{R}}
\renewcommand{\C}{\mathbb{C}}
\newcommand{\N}{\mathbb{N}}
\newcommand{\rank}{\text{rank}}
\newcommand{\const}{\text{const}}
\newcommand{\grad}{\text{grad}}

\theoremstyle{plain}
\newtheorem{axiom}{Аксиома}
\newtheorem{lemma}{Лемма}
\newtheorem{manuallemmainner}{Лемма}
\newenvironment{manuallemma}[1]{%
  \renewcommand\themanuallemmainner{#1}%
  \manuallemmainner
}{\endmanuallemmainner}

\theoremstyle{remark}
\newtheorem*{remark}{Примечание}
\newtheorem*{solution}{Решение}
\newtheorem{corollary}{Следствие}[theorem]
\newtheorem*{examp}{Пример}
\newtheorem*{observation}{Наблюдение}

\theoremstyle{definition}
\newtheorem{task}{Задача}
\newtheorem{theorem}{Теорема}[section]
\newtheorem*{definition}{Определение}
\newtheorem*{symb}{Обозначение}
\newtheorem{manualtheoreminner}{Теорема}
\newenvironment{manualtheorem}[1]{%
  \renewcommand\themanualtheoreminner{#1}%
  \manualtheoreminner
}{\endmanualtheoreminner}
\captionsetup{justification=centering,margin=2cm}
\newenvironment{colored}[1]{\color{#1}}{}

\tikzset{->-/.style={decoration={
  markings,
  mark=at position .5 with {\arrow{>}}},postaction={decorate}}}
\makeatletter
\newcommand*{\relrelbarsep}{.386ex}
\newcommand*{\relrelbar}{%
  \mathrel{%
    \mathpalette\@relrelbar\relrelbarsep
  }%
}
\newcommand*{\@relrelbar}[2]{%
  \raise#2\hbox to 0pt{$\m@th#1\relbar$\hss}%
  \lower#2\hbox{$\m@th#1\relbar$}%
}
\providecommand*{\rightrightarrowsfill@}{%
  \arrowfill@\relrelbar\relrelbar\rightrightarrows
}
\providecommand*{\leftleftarrowsfill@}{%
  \arrowfill@\leftleftarrows\relrelbar\relrelbar
}
\providecommand*{\xrightrightarrows}[2][]{%
  \ext@arrow 0359\rightrightarrowsfill@{#1}{#2}%
}
\providecommand*{\xleftleftarrows}[2][]{%
  \ext@arrow 3095\leftleftarrowsfill@{#1}{#2}%
}
\makeatother
\author{Ilya Yaroshevskiy}
\date{\today}
\title{Лекция 1, 2}
\hypersetup{
 pdfauthor={Ilya Yaroshevskiy},
 pdftitle={Лекция 1, 2},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode )}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Теория погрешности}
\label{sec:org549b6df}
\begin{defintion}
Отклонение от теоретического решения
\end{defintion}
Виды погрешности:
\begin{enumerate}
\item Неустранимая погрешность
\begin{examp}
Физические величины, другие константы
\end{examp}
\item Устранимая погрешнеость
Связана с методом решения
\begin{enumerate}
\item Погрешность модели \\
Связана с матиматической формулировкой задачи. Она плохо отображает реальную модель
\item Остаточная погрешность(Погрешноть аппроксимации)
\item Погрешность округления
\item Накапливаемая погрешность \\
Нецелые числа
\end{enumerate}
\end{enumerate}

\noindent\rule{\textwidth}{0.5pt}

\begin{itemize}
\item \(X^*\) --- точное решение \\
\item \(X\) --- Приближенное решение
\item \(X^* - X\) --- погрешность
\item \(\Delta X = |X^* - X|\) --- абсолютная погрешность \\
\(\Delta_X \ge |X^* - X|\) --- предельная абсолютная погрешность, т.е. \[ X - \Delta_X \le X^* \le X + \Delta_X \]
\item \(\delta X = \left|\frac{X^* - X}{|X|}\right|\) --- относительная погрешость \\
\(\delta_X \ge \left|\frac{X^* - X}{|X|}\right|\) --- предельная относительная погрешность
\end{itemize}

\subsection{Значащие цифры}
\label{sec:org67dd9c8}
\begin{definition}
Все цифры в изображении отличные от нуля, и нули если они содержатся
между значащими цифрами, или расположены в конце числа и указывают на
сохранение разряды точности.  Нули стоящие левее, отличной от нуля
цифры, не являются значащимицифрами Между ненулевыми, или указывающие
на точность
\end{definition}

\begin{examp}
\(\underbrace{0.00}_\text{незнач.}2080\)
\end{examp}
\begin{examp}
\(689000 = 0.689 \cdot 10^6\) --- 3 значащие цифры
\(689000 = 0.689000 \cdot 10^6\) --- 6 значащих цифр
\end{examp}

\subsection{Верные цифры}
\label{sec:org319d110}
\begin{defintion}
Если, значащая цифра приближенного значения, находящаяся в разряде, в
котором выполняется условие --- абсолютное значение погрешности не
превосходит половину уиницы этого разряда \(\Delta \le 0.5\cdot 10^k\),
где \(k\) --- номер разряда, то она называется верной
\end{defintion}

\begin{examp}
\(a = 3.635\) \\
\(\Delta a = 0.003\) \\
\begin{description}
\item[{(3) \(k = 0\)}] \(\frac{1}{2} \cdot 10^0 = \frac{1}{2} \ge \Delta a\)
\item[{(6) \(k = -1\)}] \(\frac{1}{2} \cdot 10^{-1} = 0.05 \ge \Delta a\)
\item[{(3) \(k = -2\)}] \(\frac{1}{2} \cdot 10^{-2} = 0.005 \ge \Delta a\)
\item[{(5) \(k = -3\)}] \(\frac{1}{2} \cdot 10^{-3} = 0.0005 < \Delta a\) \(\Rightarrow\) 5 --- сомнительная цифра
\end{description}
\end{examp}

\subsection{Распространение погрешности}
\label{sec:orge94efa7}
\begin{examp}
\(\left(\frac{\sqrt{2} - 1}{\sqrt{2} + 1}\right)^3 = (\sqrt{2} - 1)^6 = (3 - 2\sqrt{2})^3 = 99 - 70\sqrt{2}\) \\
\begin{description}
\item[{\(\sqrt{2}\)}] \[ \frac{7}{5} = 1.4 \]
\[ \frac{17}{12} = 1.41666 \]
\[ \frac{707}{500} = 1.414 \]
\[ \sqrt{2} = 1.4142145624 \]
\end{description}
\end{examp}

\[ \Delta_{x \pm y} = \Delta_x \pm \Delta_y \]
\[ \Delta_{(x\cdot y)} \approx |Y|\Delta_X + |X|\Delta_Y \]
\[ \Delta_{(\frac{x}{y})} \approx \left|\frac{1}{Y}\right|\Delta_X + \left|\frac{X}{Y^2}|\Delta_Y \]
\[ |\Delta u| = |f(x_1 + \Delta x_1, \dots, x_n + \Delta x_n) - f(x_1, \dots, x_n)| \]
\[ |\Delta u| \approx |df(x_1, \dots, x_n)| = \left|\sum_{i=1}^n \frac{\partial u}{\partial x_i}\Delta x_i \right| \le \sum_{i = 1}^n\left|\frac{\partial u}{\partial x_i}\right|\cdot|\Delta x_i| \addtag\label{star_1} \]
\[ |\delta u| = \frac{\ref{star_1}}{|u|} = \sum_{i = 1}^n\left|\frac{\partial u}{\partial x_i}\cdot\frac{1}{u}\right|\cdot|\Delta x_i| = \sum_{i = 1}^n \left|\frac{\partial \ln u}{\partial x_i}\right|\cdot|\Delta x_i| \]
\[ \delta_u = \sum_{i = 1}^n \left|\frac{\partial \ln u}{\partial x_i}\right| \cdot |\Delta x_i| \]
\[ \delta_{(X \pm Y)} = \left|\frac{X}{X \pm Y}\right| \delta_X + \left|\frac{Y}{X \pm Y}\right|\delta_Y \]
\[ \delta_{(X\cdot Y)} = \delta_X + \delta_Y \]
\[ \delta_{(\frac{X}{Y})} = \delta_X + \delta_Y \]

\begin{examp}
\(x = \frac{7}{5}\)
\begin{itemize}
\item \(f_1 = \left(\frac{\sqrt{2} - 1}{\sqrt{2} + 1}\right)\) \\
\[ \delta_{f_1} = 3\left|\frac{1}{x - 1} - \frac{1}{x + 1}\right|\cdot|\Delta X| = 6.25|\Delta X| \]
\item \(f_2 = (\sqrt{2} - 1)^6\) \\
\[ \delta_{f_2} = 6\left|\frac{1}{x - 1}\right|\cdot|\Delta X| = 15|\Delta X| \]
\item \(f_3 = (3 - 2\sqrt{2})^3\)
\[ \delta_{f_3} = 6\left|\frac{1}{3 - 2x}\right|\cdot|\Delta X| = 30|\Delta X| \]
\item \(f_4 = 99 - 70\sqrt{2}\)
\[ \delta_{f_4} = \left|\frac{90}{99 - 70x}\right|\cdot|\Delta X| = 70|\Delta X| \]
\end{itemize}
\end{examp}

\begin{examp}
\[ y^2 - 140y + 1 = 0 \]
Вычислить корни.
\begin{itemize}
\item \(y = 70 - \sqrt{4899}\) \\
\(\sqrt{4899} = 69.992\dots\) \\
\(\sqrt{4899} \approx 69.99\) \\
\(y \approx 70 - 69.99 = 0.01\)
\[ y = \frac{1}{70 + \sqrt{4899}} \]
\(\sqrt{4899} = 69.99;\ 70 + 69.99 = 139.99\) \\
\(y = \frac{1}{140} = 0.00714285 \approx 0.007143\)
\end{itemize}
\end{examp}


\section{Одномерная минимизация функций}
\label{sec:orgde71db4}
\subsection{Унимодальные функции}
\label{sec:org6d06a09}
\(f(x) \to \min,\ x \in U\) \\
\(f(x) \to \max \Rightarrow -f(x) \to min\) \\
\(x^* \in U\) --- точка минимума: \(f(x*) \le f(x)\ \forall x \in U\) \\
\(U^*\) --- множество точек минимума \\
\(\tilde{x} \in U: \exists V(\tilde{x})\ \forall x \in V\ f(\tilde{x}) \le f(x)\) --- локальный минимум
\begin{definition}
\(f(x)\) --- \textbf{унимодальная функция} на \([a, b]\), если:
\begin{enumerate}
\item \(f(x)\) --- непрерывна на \([a, b]\)
\item \(\exists \alpha, \beta: a \le \alpha\le\beta\le b\)
\begin{enumerate}
\item Если \(a < \alpha\), то \([a, \alpha]\) \(f(x)\) --- монотонно убывает
\item Если \(\beta < b\), то на \([\beta, b]\) \(f(x)\) --- монотонна возрастает
\item \(\forall x\in[\alpha, \beta]\) \(f(x) = f^* = \min_{[a, b]}f(x)\)
\end{enumerate}
\end{enumerate}
\end{definition}
\begin{remark}
Свойства:
\begin{enumerate}
\item Любая из точек локального минимума является глобальным минимумом на этом же отрезке
\item Функця унимодальная на \([a, b]\)  унимодальна на \([c, d] \subset [a, b]\)
\item \(f(x)\) унимодальна на \([a, b]\) \(a \le x_1 < x_2 \le b\)
\begin{enumerate}
\item если \(f(x_1)\le f(x_2)\), то \(x^* \in [a, x_2]\)
\item если \(f(x_1) > f(x_2)\), то \(x^* \in [x_1, b]\)
\end{enumerate}
\end{enumerate}
\end{remark}
\begin{definition}
\(f(x)\) \textbf{выпукла} на \([a, b]\), если:
\begin{itemize}
\item \(\forall x', x'' \in [a, b]\) и \(\alpha \in [0, 1]\): \\
\[ f(\alpha x' + (1 - \alpha)x'') \le \alpha f(x') + (1 - \alpha)f(x'') \]
\end{itemize}
\end{definition}
\begin{remark}
Свойства:
\begin{enumerate}
\item Если \(f(x)\) на \([a, b]\) \([x', x''] \subset [a, b]\)
\item Всякая выпуклая и непрерывная функция на \([a, b]\) является унимодальной на этом отрезке. Обратное не верно
\end{enumerate}
\end{remark}
\begin{definition}
\(x: f'(x) = 0\) --- \textbf{стационарная точка}
\end{definition}


\subsection{Прямые методы}
\label{sec:org6b9f92e}
Не требуют вычисление производной. Могут использовать только известные значения. 
\subsubsection{Метод дихотомии}
\label{sec:org9312671}
\[ x_1 = \frac{b + a - \delta}{2}\quad x_2 = \frac{b + a + \delta}{2} \addtag\label{delta_1} \]
\[ \tau = \frac{b - x_1}{b - a} = \frac{x_2 - a}{b - a} \rightarrow \frac{1}{2} \]
\[ X^* [a_i, b_i]\quad \frac{b_i - a_i}{2} \le \varepsilon \]

\begin{enumerate}
\item \(x_1\) и \(x_2\); вычислить \(f(x_1)\) и \(f(x_2)\)
\item \(f(x_1)\) и \(f(x_2)\)
\begin{itemize}
\item Если \(f(x_1) \le f(x_2) \rightarrow [a, x_2]\), т.е. \(b = x_2\)
\item Иначе \([x_1, b] \rightarrow [x_1, b]\), т.е. \(a = x_1\)
\end{itemize}
\item \(\varepsilon_n = \frac{b - a}{2}\) (\(n\) --- номер итерации)
\begin{itemize}
\item Если \(\varepsilon_n > \varepsilon\) --- переход к следующей итерации(шаг 1)
\item Если \(\varepsilon_n \le \varepsilon\), заврешить поиск(шаг 4)
\end{itemize}
\item \(x^* \approx \overline{x} = \frac{a + b}{2} \quad f^* \approx f(\overline{x})\)
\end{enumerate}

\(\ref{delta_1}\quad \delta \in (0, 2\varepsilon)\) \\
Число итерций \(n \ge \log_2\frac{b - a - \delta}{2\varepsilon - \delta}\)
\end{document}
